; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-13-11)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 - object)
(:init
(at-robby robot1 room7)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room3)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room12)
(at ball2 room13)
(at ball3 room10)
(at ball4 room4)
(at ball5 room1)
(at ball6 room1)
(at ball7 room10)
(at ball8 room7)
(at ball9 room2)
(at ball10 room9)
(at ball11 room5)
)
(:goal
(and
(at ball1 room2)
(at ball2 room11)
(at ball3 room1)
(at ball4 room7)
(at ball5 room6)
(at ball6 room10)
(at ball7 room11)
(at ball8 room12)
(at ball9 room13)
(at ball10 room11)
(at ball11 room8)
)
)
)

; plan
1. (pick robot1 ball8 room7 lgripper1)
   deleted: (at ball8 room7) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 0 of 11
2. (move robot2 room3 room9)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room9)
   goals met: 0 of 11
3. (move robot1 room7 room5)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room5)
   goals met: 0 of 11
4. (pick robot2 ball10 room9 lgripper2)
   deleted: (at ball10 room9) (free robot2 lgripper2)
   added: (carry robot2 ball10 lgripper2)
   goals met: 0 of 11
5. (move robot2 room9 room4)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room4)
   goals met: 0 of 11
6. (pick robot1 ball11 room5 rgripper1)
   deleted: (at ball11 room5) (free robot1 rgripper1)
   added: (carry robot1 ball11 rgripper1)
   goals met: 0 of 11
7. (pick robot2 ball4 room4 rgripper2)
   deleted: (at ball4 room4) (free robot2 rgripper2)
   added: (carry robot2 ball4 rgripper2)
   goals met: 0 of 11
8. (move robot1 room5 room8)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room8)
   goals met: 0 of 11
9. (move robot2 room4 room7)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room7)
   goals met: 0 of 11
10. (drop robot1 ball11 room8 rgripper1)
   deleted: (carry robot1 ball11 rgripper1)
   added: (at ball11 room8) (free robot1 rgripper1)
   goals met: 1 of 11
11. (drop robot2 ball4 room7 rgripper2)
   deleted: (carry robot2 ball4 rgripper2)
   added: (at ball4 room7) (free robot2 rgripper2)
   goals met: 2 of 11
12. (move robot1 room8 room6)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room6)
   goals met: 2 of 11
13. (move robot2 room7 room11)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room11)
   goals met: 2 of 11
14. (move robot1 room6 room12)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room12)
   goals met: 2 of 11
15. (drop robot2 ball10 room11 lgripper2)
   deleted: (carry robot2 ball10 lgripper2)
   added: (at ball10 room11) (free robot2 lgripper2)
   goals met: 3 of 11
16. (drop robot1 ball8 room12 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room12) (free robot1 lgripper1)
   goals met: 4 of 11
17. (pick robot1 ball1 room12 rgripper1)
   deleted: (at ball1 room12) (free robot1 rgripper1)
   added: (carry robot1 ball1 rgripper1)
   goals met: 4 of 11
18. (move robot1 room12 room2)
   deleted: (at-robby robot1 room12)
   added: (at-robby robot1 room2)
   goals met: 4 of 11
19. (move robot2 room11 room6)
   deleted: (at-robby robot2 room11)
   added: (at-robby robot2 room6)
   goals met: 4 of 11
20. (drop robot1 ball1 room2 rgripper1)
   deleted: (carry robot1 ball1 rgripper1)
   added: (at ball1 room2) (free robot1 rgripper1)
   goals met: 5 of 11
21. (pick robot1 ball9 room2 lgripper1)
   deleted: (at ball9 room2) (free robot1 lgripper1)
   added: (carry robot1 ball9 lgripper1)
   goals met: 5 of 11
22. (move robot2 room6 room13)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room13)
   goals met: 5 of 11
23. (move robot1 room2 room13)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room13)
   goals met: 5 of 11
24. (pick robot2 ball2 room13 lgripper2)
   deleted: (at ball2 room13) (free robot2 lgripper2)
   added: (carry robot2 ball2 lgripper2)
   goals met: 5 of 11
25. (drop robot1 ball9 room13 lgripper1)
   deleted: (carry robot1 ball9 lgripper1)
   added: (at ball9 room13) (free robot1 lgripper1)
   goals met: 6 of 11
26. (move robot2 room13 room6)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room6)
   goals met: 6 of 11
27. (move robot1 room13 room6)
   deleted: (at-robby robot1 room13)
   added: (at-robby robot1 room6)
   goals met: 6 of 11
28. (move robot2 room6 room11)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room11)
   goals met: 6 of 11
29. (drop robot2 ball2 room11 lgripper2)
   deleted: (carry robot2 ball2 lgripper2)
   added: (at ball2 room11) (free robot2 lgripper2)
   goals met: 7 of 11
30. (move robot1 room6 room10)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room10)
   goals met: 7 of 11
31. (move robot2 room11 room6)
   deleted: (at-robby robot2 room11)
   added: (at-robby robot2 room6)
   goals met: 7 of 11
32. (pick robot1 ball7 room10 lgripper1)
   deleted: (at ball7 room10) (free robot1 lgripper1)
   added: (carry robot1 ball7 lgripper1)
   goals met: 7 of 11
33. (move robot1 room10 room11)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room11)
   goals met: 7 of 11
34. (move robot2 room6 room10)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room10)
   goals met: 7 of 11
35. (drop robot1 ball7 room11 lgripper1)
   deleted: (carry robot1 ball7 lgripper1)
   added: (at ball7 room11) (free robot1 lgripper1)
   goals met: 8 of 11
36. (pick robot2 ball3 room10 lgripper2)
   deleted: (at ball3 room10) (free robot2 lgripper2)
   added: (carry robot2 ball3 lgripper2)
   goals met: 8 of 11
37. (move robot2 room10 room1)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room1)
   goals met: 8 of 11
38. (move robot1 room11 room6)
   deleted: (at-robby robot1 room11)
   added: (at-robby robot1 room6)
   goals met: 8 of 11
39. (drop robot2 ball3 room1 lgripper2)
   deleted: (carry robot2 ball3 lgripper2)
   added: (at ball3 room1) (free robot2 lgripper2)
   goals met: 9 of 11
40. (pick robot2 ball6 room1 rgripper2)
   deleted: (at ball6 room1) (free robot2 rgripper2)
   added: (carry robot2 ball6 rgripper2)
   goals met: 9 of 11
41. (move robot1 room6 room1)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room1)
   goals met: 9 of 11
42. (move robot2 room1 room10)
   deleted: (at-robby robot2 room1)
   added: (at-robby robot2 room10)
   goals met: 9 of 11
43. (pick robot1 ball5 room1 lgripper1)
   deleted: (at ball5 room1) (free robot1 lgripper1)
   added: (carry robot1 ball5 lgripper1)
   goals met: 9 of 11
44. (drop robot2 ball6 room10 rgripper2)
   deleted: (carry robot2 ball6 rgripper2)
   added: (at ball6 room10) (free robot2 rgripper2)
   goals met: 10 of 11
45. (move robot1 room1 room6)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room6)
   goals met: 10 of 11
46. (drop robot1 ball5 room6 lgripper1)
   deleted: (carry robot1 ball5 lgripper1)
   added: (at ball5 room6) (free robot1 lgripper1)
   goals met: 11 of 11
